# Pandas Crash Course

## Series

It is the basic building block of pandas.

It is build on top of numpy array and has a named index in addition to a numerical index.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']

In [3]:
val = [10,20,30]

In [4]:
arr = np.array(val)

In [5]:
d ={'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(data=val) # from list

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr) # from np array

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr,index=labels) # from array with labels

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=[10,'a',4.4]) # series can be heterogeneous

0     10
1      a
2    4.4
dtype: object

In [10]:
pd.Series(d) # from dict

a    10
b    20
c    30
dtype: int64

In [11]:
series1 = pd.Series({"Python":10,"C++":20,"C":30})
series1

Python    10
C++       20
C         30
dtype: int64

In [12]:
series2 = pd.Series({"Python":20,"Java":10,"C#":10,"C++":30})
series2

Python    20
Java      10
C#        10
C++       30
dtype: int64

In [13]:
series1 + series2 # adding series

C          NaN
C#         NaN
C++       50.0
Java       NaN
Python    30.0
dtype: float64

## DataFrames
A DataFrame contains multiple series that share the same index.

It is a tabular data storage

In [14]:
rand_mat = np.random.randn(5,4)

In [15]:
rand_mat

array([[ 0.72155216, -1.91415695, -0.79158835,  0.45008676],
       [-1.12876258, -0.75004619,  0.81076272,  1.21674039],
       [-0.8879935 ,  0.59301031, -0.51896824, -1.47938072],
       [ 0.05812665,  0.11299943,  0.45966134,  0.03885732],
       [ 0.75339692, -0.53551831,  1.67477428,  1.74413254]])

In [16]:
pd.DataFrame(data =rand_mat) # create dataframe from numpy array

          0         1         2         3
0  0.721552 -1.914157 -0.791588  0.450087
1 -1.128763 -0.750046  0.810763  1.216740
2 -0.887993  0.593010 -0.518968 -1.479381
3  0.058127  0.112999  0.459661  0.038857
4  0.753397 -0.535518  1.674774  1.744133

In [17]:
df = pd.DataFrame(data =rand_mat, index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.721552 -1.914157 -0.791588  0.450087
B -1.128763 -0.750046  0.810763  1.216740
C -0.887993  0.593010 -0.518968 -1.479381
D  0.058127  0.112999  0.459661  0.038857
E  0.753397 -0.535518  1.674774  1.744133

In [18]:
df['W'] # access column

A    0.721552
B   -1.128763
C   -0.887993
D    0.058127
E    0.753397
Name: W, dtype: float64

In [19]:
type(df['W'])

pandas.core.series.Series

In [20]:
df[['W','Y']] # access multiple columns

          W         Y
A  0.721552 -0.791588
B -1.128763  0.810763
C -0.887993 -0.518968
D  0.058127  0.459661
E  0.753397  1.674774

In [21]:
type(df[['W','Y']])

pandas.core.frame.DataFrame

In [22]:
df['NEW'] = df['W']+df['Y'] # add a column

In [23]:
df

          W         X         Y         Z       NEW
A  0.721552 -1.914157 -0.791588  0.450087 -0.070036
B -1.128763 -0.750046  0.810763  1.216740 -0.318000
C -0.887993  0.593010 -0.518968 -1.479381 -1.406962
D  0.058127  0.112999  0.459661  0.038857  0.517788
E  0.753397 -0.535518  1.674774  1.744133  2.428171

In [24]:
df.drop('NEW',axis=1) # axis=0 row, axis=1 col

          W         X         Y         Z
A  0.721552 -1.914157 -0.791588  0.450087
B -1.128763 -0.750046  0.810763  1.216740
C -0.887993  0.593010 -0.518968 -1.479381
D  0.058127  0.112999  0.459661  0.038857
E  0.753397 -0.535518  1.674774  1.744133

In [25]:
df # does not drop the column

          W         X         Y         Z       NEW
A  0.721552 -1.914157 -0.791588  0.450087 -0.070036
B -1.128763 -0.750046  0.810763  1.216740 -0.318000
C -0.887993  0.593010 -0.518968 -1.479381 -1.406962
D  0.058127  0.112999  0.459661  0.038857  0.517788
E  0.753397 -0.535518  1.674774  1.744133  2.428171

In [26]:
df.drop('NEW',axis=1,inplace=True) # or df = df.drop('NEW',axis=1)

In [27]:
df

          W         X         Y         Z
A  0.721552 -1.914157 -0.791588  0.450087
B -1.128763 -0.750046  0.810763  1.216740
C -0.887993  0.593010 -0.518968 -1.479381
D  0.058127  0.112999  0.459661  0.038857
E  0.753397 -0.535518  1.674774  1.744133

In [28]:
df.drop('A') # default axis=0 and inplace=False

          W         X         Y         Z
B -1.128763 -0.750046  0.810763  1.216740
C -0.887993  0.593010 -0.518968 -1.479381
D  0.058127  0.112999  0.459661  0.038857
E  0.753397 -0.535518  1.674774  1.744133

In [29]:
df

          W         X         Y         Z
A  0.721552 -1.914157 -0.791588  0.450087
B -1.128763 -0.750046  0.810763  1.216740
C -0.887993  0.593010 -0.518968 -1.479381
D  0.058127  0.112999  0.459661  0.038857
E  0.753397 -0.535518  1.674774  1.744133

In [30]:
df.loc['A'] # access row location

W    0.721552
X   -1.914157
Y   -0.791588
Z    0.450087
Name: A, dtype: float64

In [31]:
type(df.loc['A'])

pandas.core.series.Series

In [32]:
df.iloc[0] # access row with index location

W    0.721552
X   -1.914157
Y   -0.791588
Z    0.450087
Name: A, dtype: float64

In [33]:
type(df.iloc[0])

pandas.core.series.Series

In [34]:
df.loc[['A','C']] # access multiple rows

          W         X         Y         Z
A  0.721552 -1.914157 -0.791588  0.450087
C -0.887993  0.593010 -0.518968 -1.479381

In [35]:
type(df.loc[['A','C']])

pandas.core.frame.DataFrame

In [36]:
df.loc[['A','C']][['Y','Z']] # select subset of the dataframe

          Y         Z
A -0.791588  0.450087
C -0.518968 -1.479381

In [37]:
df.loc[['A','C'],['Y','Z']] # select subset of the dataframe

          Y         Z
A -0.791588  0.450087
C -0.518968 -1.479381

In [38]:
df>0 # conditional operations

       W      X      Y      Z
A   True  False  False   True
B  False  False   True   True
C  False   True  False  False
D   True   True   True   True
E   True  False   True   True

In [39]:
df[df>0] # conditional acess

          W         X         Y         Z
A  0.721552       NaN       NaN  0.450087
B       NaN       NaN  0.810763  1.216740
C       NaN  0.593010       NaN       NaN
D  0.058127  0.112999  0.459661  0.038857
E  0.753397       NaN  1.674774  1.744133

In [40]:
df['W']>0

A     True
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [41]:
df[df['W']>0] # conditional acess on columns

          W         X         Y         Z
A  0.721552 -1.914157 -0.791588  0.450087
D  0.058127  0.112999  0.459661  0.038857
E  0.753397 -0.535518  1.674774  1.744133

In [42]:
df[df['W']>0][['X','Y']]

          X         Y
A -1.914157 -0.791588
D  0.112999  0.459661
E -0.535518  1.674774

In [43]:
# and/or operators do not work with pd.Series 
# conditions should be wrapped inside of ()
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.753397 -0.535518  1.674774  1.744133

In [44]:
df.reset_index() # not inplace

  index         W         X         Y         Z
0     A  0.721552 -1.914157 -0.791588  0.450087
1     B -1.128763 -0.750046  0.810763  1.216740
2     C -0.887993  0.593010 -0.518968 -1.479381
3     D  0.058127  0.112999  0.459661  0.038857
4     E  0.753397 -0.535518  1.674774  1.744133

In [45]:
new_ind = 'CA NY WY OR CO'.split()

In [46]:
df['States'] = new_ind

In [47]:
df

          W         X         Y         Z States
A  0.721552 -1.914157 -0.791588  0.450087     CA
B -1.128763 -0.750046  0.810763  1.216740     NY
C -0.887993  0.593010 -0.518968 -1.479381     WY
D  0.058127  0.112999  0.459661  0.038857     OR
E  0.753397 -0.535518  1.674774  1.744133     CO

In [48]:
df.set_index('States') # not inplace

               W         X         Y         Z
States
CA      0.721552 -1.914157 -0.791588  0.450087
NY     -1.128763 -0.750046  0.810763  1.216740
WY     -0.887993  0.593010 -0.518968 -1.479381
OR      0.058127  0.112999  0.459661  0.038857
CO      0.753397 -0.535518  1.674774  1.744133

In [49]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z
States
CA      0.721552 -1.914157 -0.791588  0.450087
NY     -1.128763 -0.750046  0.810763  1.216740
WY     -0.887993  0.593010 -0.518968 -1.479381
OR      0.058127  0.112999  0.459661  0.038857
CO      0.753397 -0.535518  1.674774  1.744133

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [51]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [52]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.096736 -0.498742  0.326928  0.394087
std    0.881401  0.953160  1.004368  1.238809
min   -1.128763 -1.914157 -0.791588 -1.479381
25%   -0.887993 -0.750046 -0.518968  0.038857
50%    0.058127 -0.535518  0.459661  0.450087
75%    0.721552  0.112999  0.810763  1.216740
max    0.753397  0.593010  1.674774  1.744133

In [53]:
df['W']>0

States
CA     True
NY    False
WY    False
OR     True
CO     True
Name: W, dtype: bool

In [54]:
series = df['W']>0

In [55]:
series.value_counts()

True     3
False    2
Name: W, dtype: int64